; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; USE CASE - 3 - Projection Aware Human-in-the-Loop Plan Execution
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain PAPE-hilp)

(:requirements :strips :typing)

(:types
block
human robot - agent
)

(:predicates
(on ?a - agent ?x ?y - block)
(ontable ?x - block)
(clear ?x - block)
(holding ?a - agent ?x - block)
(handempty ?a - agent)
(isword ?b1 ?b2 ?b3 - block)
(word-formed ?a - agent)
(which-word ?a - agent ?b1 ?b2 ?b3 - block)
)

(:action makeword
:parameters (?a - agent ?b1 ?b2 ?b3 - block)
:precondition
(and
(on ?a ?b1 ?b2)
(on ?a ?b2 ?b3)
(clear ?b1)
(isword ?b1 ?b2 ?b3)
)
:effect
(and
(word-formed ?a)
(which-word ?a ?b1 ?b2 ?b3)
)
)

(:action pick-up
:parameters (?a - agent ?x - block)
:precondition
(and
(clear ?x)
(ontable ?x)
(handempty ?a)
)
:effect
(and
(not (ontable ?x))
(not (clear ?x))
(not (handempty ?a))
(holding ?a ?x)
)
)

(:action put-down
:parameters (?a - agent ?x - block)
:precondition
(and
(holding ?a ?x)
)
:effect
(and
(not (holding ?a ?x))
(clear ?x)
(handempty ?a)
(ontable ?x)
)
)

(:action stack
:parameters (?a - agent ?x ?y - block)
:precondition
(and
(holding ?a ?x)
(clear ?y)
)
:effect
(and
(not (holding ?a ?x))
(not (clear ?y))
(clear ?x)
(handempty ?a)
(on ?a ?x ?y)
)
)

(:action unstack
:parameters (?a - agent ?x ?y - block)
:precondition
(and
(on ?a ?x ?y)
(clear ?x)
(handempty ?a)
)
:effect
(and
(holding ?a ?x)
(clear ?y)
(not (clear ?x))
(not (handempty ?a))
(not (on ?a ?x ?y))
)
)

)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; USE CASE - 3 - Projection Aware Human-in-the-Loop Plan Execution
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem BRAT-hilp)

(:domain PAPE-hilp)

(:objects
A B C O R T  - block
Fetch - robot
Me - human
)

(:init
;; hand is empty
(handempty Fetch)
(handempty Me)
;; all blocks are clear
(clear A)
(clear B)
(clear C)
(clear O)
(clear R)
(clear T)
;; all blocks on the table
(ontable A)
(ontable B)
(ontable C)
(ontable O)
(ontable R)
(ontable T)
;; available words
(isword A R T)
(isword R A T)
(isword C O B)
)

(:goal
(and
(which-word Fetch A R T)
)
)

)

; plan
1. (pick-up fetch r)
   deleted: (ontable r) (clear r) (handempty fetch)
   added: (holding fetch r)
   goals met: 0 of 1
2. (stack fetch r t)
   deleted: (holding fetch r) (clear t)
   added: (clear r) (handempty fetch) (on fetch r t)
   goals met: 0 of 1
3. (pick-up fetch a)
   deleted: (ontable a) (clear a) (handempty fetch)
   added: (holding fetch a)
   goals met: 0 of 1
4. (stack fetch a r)
   deleted: (holding fetch a) (clear r)
   added: (clear a) (handempty fetch) (on fetch a r)
   goals met: 0 of 1
5. (makeword fetch a r t)
   added: (word-formed fetch) (which-word fetch a r t)
   goals met: 1 of 1
